[{"model": "interview_db.resourcelink", "pk": 1, "fields": {"url": "https://www.gcflearnfree.org/jobsearchandnetworking/networking-basics/1/", "title": "Job Search and Networking Basics"}}, {"model": "interview_db.resourcelink", "pk": 2, "fields": {"url": "https://careers.uw.edu/resources/networking-activities/view/", "title": "Networking Activities Worksheet (PDF)"}}, {"model": "interview_db.resourcelink", "pk": 3, "fields": {"url": "https://www.huffingtonpost.com/stacia-pierce/11-secrets-to-choosing-th_b_6038658.html", "title": "Choosing the Right Friends"}}, {"model": "interview_db.resourcelink", "pk": 4, "fields": {"url": "https://collegeinfogeek.com/make-friends-college/", "title": "How to Make Friends in College"}}, {"model": "interview_db.resourcelink", "pk": 5, "fields": {"url": "https://www.youtube.com/watch?time_continue=129&v=5n6gbpCqA5g", "title": "Friendship & Vulnerability"}}, {"model": "interview_db.resourcelink", "pk": 6, "fields": {"url": "https://www.washington.edu/uaa/advising/academic-planning/choosing-courses/overview/", "title": "What Courses Should I Take?"}}, {"model": "interview_db.resourcelink", "pk": 7, "fields": {"url": "https://fyp.washington.edu/healthyhuskies/", "title": "Healthy Huskies"}}, {"model": "interview_db.resourcelink", "pk": 8, "fields": {"url": "https://idealistcareers.org/a-quick-guide-to-writing-your-elevator-pitch-with-examples/", "title": "A Quick Guide to Writing Your Elevator Pitch"}}, {"model": "interview_db.resourcelink", "pk": 9, "fields": {"url": "https://students.tufts.edu/career-center/i-need/network/professional-email-etiquette", "title": "Professional Email Etiquette"}}, {"model": "interview_db.resourcelink", "pk": 10, "fields": {"url": "https://careers.uw.edu/blog/2017/08/02/what-if-my-major-doesnt-match-my-career-plans/", "title": "What If My Major Doesn’t Match My Career Plans?"}}, {"model": "interview_db.resourcelink", "pk": 11, "fields": {"url": "https://www.collegexpress.com/articles-and-advice/majors-and-academics/articles/choosing-major/truth-about-college-majors/", "title": "The Truth About College Majors"}}, {"model": "interview_db.resourcelink", "pk": 12, "fields": {"url": "https://www.youtube.com/watch?v=KUWn_TJTrnU", "title": "Growth Mindset vs. Fixed Mindset"}}, {"model": "interview_db.resourcelink", "pk": 13, "fields": {"url": "https://www.youtube.com/watch?v=aNHas97iE78", "title": "4 Steps to a Developing a Growth Mindset"}}, {"model": "interview_db.resourcelink", "pk": 15, "fields": {"url": "http://www.naceweb.org/career-development/trends-and-predictions/job-outlook-2016-attributes-employers-want-to-see-on-new-college-graduates-resumes/", "title": "The Attributes Employers Want to See on New College Graduates’ Resumes"}}, {"model": "interview_db.resourcelink", "pk": 16, "fields": {"url": "https://www.youtube.com/watch?v=SemHh0n19LA", "title": "Designing Your Life, TEDXStanford"}}, {"model": "interview_db.resourcelink", "pk": 17, "fields": {"url": "http://www.nytimes.com/2010/08/03/opinion/03brooks.html?ref=opinion", "title": "The Summoned Self"}}, {"model": "interview_db.resourcelink", "pk": 18, "fields": {"url": "http://campusgrotto.com/taking-classes-outside-your-major.html", "title": "Taking Classes Outside your Major"}}, {"model": "interview_db.resourcelink", "pk": 19, "fields": {"url": "https://www.teenvogue.com/story/classes-to-take-in-college", "title": "Why You Should Step Outside Your Major When Signing Up for Classes"}}, {"model": "interview_db.resourcelink", "pk": 20, "fields": {"url": "https://www.huffingtonpost.com/entry/3-powerful-decision-making-strategies-of-successful_us_57ed81e6e4b0972364deaed3", "title": "3 Powerful Decision-Making Strategies of Successful Leaders"}}, {"model": "interview_db.resourcelink", "pk": 21, "fields": {"url": "http://www.wisebread.com/10-ways-to-improve-your-decision-making-skills", "title": "10 Ways to Improve Your Decision-Making Skills"}}, {"model": "interview_db.resourcelink", "pk": 22, "fields": {"url": "https://careers.uw.edu/resources/resumes-tips-advice/view/", "title": "Résumé"}}, {"model": "interview_db.category", "pk": 2, "fields": {"title": "Make Your Way", "slug": "make-your-way"}}, {"model": "interview_db.category", "pk": 3, "fields": {"title": "Know Yourself", "slug": "know-yourself"}}, {"model": "interview_db.category", "pk": 4, "fields": {"title": "Know the World", "slug": "know-world"}}, {"model": "interview_db.category", "pk": 5, "fields": {"title": "Weave it Together", "slug": "weave-together"}}, {"model": "interview_db.article", "pk": 3, "fields": {"title": "Jobs Come Through People You Know", "short_body": "Most jobs emerge through people you know. Find out how to take the first step in building a professional network.", "long_body": "<p>Getting to know people in order to build your career is called networking. If this word and concept intimidate you, know you are in good company; most people cringe at the idea. There are, however, some easy ways to make connections with new people and strengthen connections you already have.</p> \r\n\r\n<h3>Your current communities</h3>\r\n<p>The good news is that you already have a network in your friends and family. Add to that people that you know from different social organizations, such as RSOs, sports teams, or spiritual organizations. These connections are part of your network even though you don't know them in a professional setting. They may work at a job related to one you are seeking, and they might be able to share information and contacts that could help you in your job search. Don't be afraid to say to your connections, \"I'm really interested in [name of field/job]. Is there someone you know who could help me learn more?\"</p>\r\n\r\n<h3>Making new contacts</h3>\r\n<p>You might be introduced to someone at an event, or you might have the opportunity to set up an informational interview with a new contact. A good way to break the ice is to ask the other person  purposeful questions. People generally like talking about themselves, including what they do for work and their interests. Place your focus on getting to know your new contact and thinking about how this person might fit in to your network. You're not asking for a job, just more information. Try: </p>\r\n\r\n<ul>\r\n<li>What steps did you take that led to your current job? </li>\r\n<li>What is the most satisfying aspect of your job? </li>\r\n<li>What are the biggest challenges you face? </li>\r\n<li>What would you differently if you had to do it all over again? </li>\r\n<li>What one piece of advice do you have for someone starting out? </li>\r\n</ul>\r\n\r\n<h3>Stay positive</h3>\r\n<p>The way you present yourself makes a lasting impression. While it is normal to feel nervous or discouraged when talking to someone who might have a job connection, the key is to remain positive and optimistic when introducing yourself. Keep in mind that networking goes two ways – each person must benefit. Show an interest in the other person instead of focusing only on yourself and the outcome you want.</p>", "image": "interview_db_images/jobs_come_through_people_you_know.jpg", "image_credit": "UW College of Arts & Sciences", "image_alt_text": "Students with name tags sit at a round table smiling and laughing.", "category": 2, "slug": "jobs-come-through-people-you-know", "phase": "A", "quarter": "winter", "week": 2, "related_articles": [4, 5, 11, 12], "related_links": [1, 2]}}, {"model": "interview_db.article", "pk": 4, "fields": {"title": "Your Friends, Your Success", "short_body": "Friendships are more important than you think. Here's how the best ones function.", "long_body": "<p>There’s no one right way to “do” friends at UW – some people have many friends from different social circles, others have a few close ties. What’s important is the quality of those relationships.</p>\r\n\r\n<p>Research shows that friendships support your success when they provide the following:</p>\r\n<ul>\r\n<li><strong>Social support</strong> – All work and no play is not the way to succeed. Seek friends who can share with you your ups and downs, make you laugh, and get you out and doing things.</li>\r\n<li><strong>Academic help</strong> – Seek friends who can advise you on study strategies, recommend courses, or introduce you to new majors. Study buddies also matter – people who to proofread your drafts, quiz you before an exam, or simply study with or alongside you.</li>\r\n<li><strong>Academic encouragement</strong> – Emotional support matters, too. Seek friends who will wish you luck on your exam, tell you you’ll do great, and congratulate you or commiserate depending on the results. Supportive friends also help you deal with stress and understand your need to stay in when you really need to hit the books.</li>\r\n<li><strong>Intellectual discussions</strong> – Discussions about ideas are an important way to integrate your social and academic life. Whether you talk about small things you learned in class or tackle big controversial issues, these discussions deepen both your thinking and your friendships.</li>\r\n</ul>\r\n<p>These types of supports don’t need to come from the same friends – you might study with some and socialize with others – but together they function as an important part of a successful Husky experience.</p>", "image": "interview_db_images/your_friends_your_success.jpg", "image_credit": "", "image_alt_text": "Environmental Science students enjoy a group field trip to the North Cascades.", "category": 3, "slug": "your-friends-your-success", "phase": "A", "quarter": "spring", "week": 2, "related_articles": [3, 5, 15], "related_links": [3]}}, {"model": "interview_db.article", "pk": 5, "fields": {"title": "You Are Your Network", "short_body": "A web of differing professional contacts is the strongest net for catching a job. Who are they?", "long_body": "<p>Imagine networking is like spinning a web: you are at the center and want to gather around you people with different strengths, personalities, connections and ways of relating to you. Job search gurus describe 10 types of people to weave into your web:</p>\r\n\r\n<ul>\r\n<li><strong>Mentor</strong> – Someone you can learn from, someone who knows you well and who cares about your success</li>\r\n<li><strong>Expert</strong> – Someone with expert information about the field you want to enter, and where it's headed </li>\r\n<li><strong>Connector</strong> – Someone who's great at seeing opportunities and connecting you to people, resources and information</li>\r\n<li><strong>Coach</strong> – Someone who helps you think through your decisions – and remains objective in the process</li>\r\n<li><strong>Visionary</strong> – A “blue sky” thinker who fuels your dreams</li>\r\n<li><strong>Realist</strong> – An “on the ground” pragmatist who gives you a reality check </li>\r\n<li><strong>Guide</strong> – Someone who's been on the journey and who can help you make a plan for achieving your goal</li>\r\n<li><strong>Fellow Traveler</strong> – Someone in a similar place as you, who can share your ups and downs</li>\r\n<li><strong>Mentee</strong> – Someone one step behind you to whom you can offer help</li>\r\n</ul>\r\n\r\n<p>This is a guide, not a formula, for thinking about your network and who you may want to add. Aim for diversity in your network – people from different fields, age groups, cultural backgrounds – as you think of people who could fill one or more roles. Eventually, you'll build a strong professional network that endures over time.</p>", "image": "interview_db_images/you_are_your_network.jpg", "image_credit": "", "image_alt_text": "Close-up of the building directory in Bagley Hall.", "category": 2, "slug": "you-are-your-network", "phase": "A", "quarter": "spring", "week": 8, "related_articles": [3, 4, 12], "related_links": []}}, {"model": "interview_db.article", "pk": 6, "fields": {"title": "Where's Your Focus – Learning or Competing?", "short_body": "You can alleviate some of the academic pressure you feel by identifying its source and evaluating whether that pressure is real or necessary.", "long_body": "<p>You faced competition getting into UW, and you may still be feeling competition now that you're in. Some academic pressure can be motivating, but competition can be harmful when you find yourself always comparing yourself to others, obsessing about grades, or feeling jealous or bitter about others’ accomplishments. Competition may exist, but you don’t have to suffer because of it.</p>\r\n\r\n<p>Here are some options for dealing with competition:</p>\r\n<ul>\r\n<li><strong>Acknowledge your frustrations and disappointments</strong> – When you are feeling the burden of competition, give your feelings a voice. Take a moment and try to articulate what you’re feeling in a specific statement like “I’m frustrated that I spend so much time studying but still don’t get the highest grades” or “I’m disappointed that I didn’t get that internship.” Acknowledging your feelings can lessen their impact.</li>\r\n\r\n<li><strong>Expect to \"win some, lose some\"</strong> – No matter how much effort you put in, you can’t expect to always come out on top. Dealing with competition means developing a healthy attitude toward both winning and losing. Be proud when you’re successful, and don’t beat yourself up if you don’t always excel. \r\n\r\n<li><strong>Focus on yourself and your own goals</strong> – The “everyone else is better than me” mindset disappears when you don’t focus on everyone else. Focus on the goals YOU set for yourself. Be clear about what you want to achieve and work steadily toward it. Acknowledge how much you’re learning, and be proud of the effort you put in AND how you’re taking care of yourself. Other people’s performance doesn’t matter. Really.</li>\r\n\r\n<li><strong>Cultivate a non-competitive environment</strong> – If you wish the environment in your program were less competitive, then make a change to be kinder. Offer help to others–they may be willing to reciprocate in the future. When someone announces an achievement, offer a sincere congratulations, and then change the subject. Let your work and your actions speak for themselves.</li>\r\n\r\n<li><strong>Recognize that admission into a competitive program is not admission into an elite program</strong> – UW has several capacity-constrained majors, and it’s true that not everyone who applies to one of these majors can be accepted. Recognize that those accepted are not better people than those who were not accepted. Don’t tie your self-worth to an institutional constraint.</li>\r\n\r\n<li><strong>See happiness as a greater accomplishment</strong> – Finally, recognize that your happiness and overall mental health are more important than grades and school. Invest in friendships. Take time to play and relax. Super competitive students are usually not happy. Focus on the happiness you can gain from where you are.</li>\r\n</ul>", "image": "interview_db_images/whats_your_focus_learning_competing.jpg", "image_credit": "UW College of Arts & Sciences", "image_alt_text": "Close up of several students sitting in a row during a lecture class.", "category": 4, "slug": "wheres-your-focuslearning-or-competing", "phase": "A", "quarter": "winter", "week": 3, "related_articles": [10, 13, 17, 20], "related_links": []}}, {"model": "interview_db.article", "pk": 7, "fields": {"title": "Tired of Feeling Alone?", "short_body": "UW is huge. How do you find friends you really click with?", "long_body": "<p>One thing we've heard from students is that it's a lot easier to make friends with people who share your interests once you're in a major. Until then, however, it can be challenging, especially if you’re taking large lecture courses where it may be difficult to get to know your classmates.</p>\r\n\r\n<p>Some people get lucky and instantly bond with roommates, or teammates, or find the community they're looking for in an RSO. If you're still feeling like you haven't met your peeps, however, don’t give up. Finding true friends takes time, patience, and a little effort. Following are some strategies that might pay off.\r\n\r\n<h3>Opportunities for Conversation</h3>\r\n<p>First, look for opportunities to have increasingly more substantive conversations with others over time. Over the course of a quarter, classes, and maybe study groups are two places you're likely to see the same people repeatedly. Try to learn more about the people around you each time you meet. Strategies include: </p>\r\n<ul>\r\n<li><strong>Study groups</strong> – Try taking 5 minutes at the start of your group for all members to “check in” and share in a sentence or two how they are and what’s going on for them. You’ll get to know each other better this way, and can always follow up after the study session is over.</li>\r\n<li><strong>Classes</strong> – In small classes, it's a lot easier to see the same people repeatedly. Take advantage of time before and after class, or when assigned to a group, to introduce yourself and, over time, move from talking about things related to the class to things beyond the class. Students often say that the quarter ends just as they’re starting to know their classmates. If you’re not sure you’ll see these classmates again but would like to continue getting to know them, tell them. It can be as simple as, “It was fun working with you this quarter. Would you like to keep in touch?”</li>\r\n</ul>\r\n\r\n<h3>Express Your Values</h3>\r\n<p>Second, express your values. Often the people we “click” with are people who share our values or interests, or who have similar personality traits or life experiences. The values or experiences that count, however, may not be visible from the outside. Look for ways that people elect to show what they care about–joining RSOs, volunteering, participating in certain events–and do the same. Get to know some people in these environments, and ask them to introduce you to other people they know. The more broad your interactions, the more likely you’ll eventually find the folks that make you feel at home.</p>\r\n\r\n<h3>Be Open To It</h3>\r\n<p>Finally, be open. You never know when a shared experience (missed bus?) will lead you to discover that you and a stranger have something deeply meaningful in common.</p>", "image": "interview_db_images/tired_feeling_alone.jpg", "image_credit": "Dennis Wise", "image_alt_text": "A crowd of students walking to classes on Red Square.", "category": 3, "slug": "tired-feeling-alone", "phase": "A", "quarter": "winter", "week": 4, "related_articles": [3, 4, 19], "related_links": [4, 5]}}, {"model": "interview_db.article", "pk": 8, "fields": {"title": "Falling in Love with a Class", "short_body": "What are you taking this quarter? Do you love it or are you just making it work? Sometimes a class can open a whole new world, but how do you find the one?", "long_body": "<p>No matter your major (yes, some courses you just must take), choosing your classes continues to be a way to explore new ideas, challenge yourself, and be immersed in different worlds. You can make those NWs and VLPAs work for you!</p>\r\n\r\n<p>Here are some ideas for using opportunities wisely:</p>\r\n\r\n<ul>\r\n<li>Check out the current courses being taught faculty who have won <a href=\" http://www.washington.edu/teaching/awards/awards-recipients\">Distinguished Teaching Awards</a>.</li>\r\n<li>Think back on your favorite class or subject – what courses will give you the opportunity to dive deeper?</li>\r\n<li>Is your favorite faculty teaching something new? Email them and ask!</li>\r\n<li>Advisers have <a href=\"https://www.washington.edu/uaa/advising/academic-planning/choosing-courses/courses-recommended-by-advisers\">suggestions for great courses</a> in their departments; searching websites and blogs can often unearth some gems.</li>\r\n<li>Ask your friends about their favorite classes.</li>\r\n</ul>", "image": "interview_db_images/falling_love_with_class.jpg", "image_credit": "", "image_alt_text": "UW students dancing at the Meany Hall dance studio.", "category": 4, "slug": "falling-love-class", "phase": "A", "quarter": "winter", "week": 5, "related_articles": [10, 13, 19, 20], "related_links": [6]}}, {"model": "interview_db.article", "pk": 9, "fields": {"title": "No Time to be Healthy?", "short_body": "It can certainly feel that way. The trick is to slip in activities that are truly restorative and nourishing.", "long_body": "<p>The college lifestyle doesn’t exactly encourage discipline when it comes to getting a good night’s sleep, exercising, and eating healthy. Especially if you’re crazy busy or feeling stressed, the last thing you probably want to hear is someone reminding you to take care of your health. But you probably know this already: when you prioritize your health, tasks that seem overwhelming suddenly become manageable. And over time, you’re likely to be happier and better able to handle your work and other challenges if you attend to your wellness.</p>\r\n\r\n<p>How to do that with limited time? Make time for activities that will restore and nourish your body and brain.</p>\r\n\r\n<p>Here are some options we found that are great rejuvenators:</p>\r\n<ul>\r\n<li><strong>Breathe deeply</strong> – First thing in the morning, in the shower, on the bus, any time you think of it. Take 5-10 deep breaths that fill your belly and lungs, and exhale slowly. That extra boost of oxygen will clear your mind and help reduce stress.</li>\r\n<li><strong>Meditate</strong> – This is more intentional deep breathing, where you find a place to sit, close your eyes, and focus carefully on your inhale and exhale. Acknowledge when thoughts appear, then go back to the breath without any judgment. 15-20 minutes is ideal.</li>\r\n<li><strong>Engage your senses</strong> – Prepare a good meal if you can, or at least eat one, slowing down to savor the tastes and textures. Close your eyes and listen fully to your favorite music. Take a walk outside in nature, taking in the smells and temperature of the air. Draw or color. If you're so lucky, play or snuggle with a furry pet.</li>\r\n<li><strong>Move</strong> – Do anything to get your blood pumping for at least a minute, multiple times a day. 25 jumping jacks. Wild dancing to your favorite tunes. Skipping across the quad – getting outside provides an extra boost. This kind of movement can interrupt the stress response. And it will probably make you want to move more often, for longer.</li>\r\n<li><strong>Feel gratitude</strong> – When you spend time thinking about someone or something you appreciate, you release positive brain chemicals. New brain science says that you’re a tiny bit healthier whenever you conjure a positive emotional thought. Make it a goal every day to conjure more positive thoughts than negative. </li>\r\n<li><strong>Say no</strong> – To whatever you know will cause you to overextend yourself. Or whatever doesn’t feel right for you.</li>\r\n<li><strong>Say yes</strong> – To goofing around and laughing hard. To spending time talking with others – in person or on the phone. Really restorative activity gets you away from the screen.</li>\r\n<li><strong>Sleep</strong> – Yeah, we know you’ve heard this one before, but here it is again because it’s so important. Your body needs sleep to function at its best, physically, mentally, emotionally. Can’t get 8 hours of sleep? Nap. Research says 25 minutes is good, 60-90 minutes is better.</li>\r\n</ul>\r\n\r\n<p>Take care of your health, and other things will look a lot more manageable.</p>", "image": "interview_db_images/no_time_to_be_healthy.jpg", "image_credit": "Tricia Caparas", "image_alt_text": "UW Students make time to enjoy the UW/UCLA football game in 2010.", "category": 3, "slug": "no-time-be-healthy", "phase": "A", "quarter": "winter", "week": 6, "related_articles": [6, 7, 14], "related_links": [7]}}, {"model": "interview_db.article", "pk": 10, "fields": {"title": "Solve World Problems", "short_body": "You care deeply about something – climate change, human rights, clean energy, healthcare – and want to help solve world problems. Where to begin?", "long_body": "<p>First, know that your contributions will be welcome, however large or small, and many paths are available to you to make a difference in the world. Most problems facing humanity are extremely complex, and their solutions require thousands of contributors from many disciplines with diverse skill sets.</p>\r\n\r\n<p>If you're set on tackling world issues, you might start by identifying the ways you like to tackle and solve problems generally. Do you like being \"up close and personal\" with a problem&#8211;on the ground administering vaccines, for example&#8211;or do you prefer to address \"the big picture\" &#8211;maybe monitoring the path of an epidemic? The next step is to identify which disciplines (and majors) best align to the way in which you like tackling and solving problems. One way to do this is by searching UW.edu or UW Today for news about faculty or organizations working on the issues you care about. Find the people mentioned, and make an appointment to talk to them. Try to get a sense of the following:</p>\r\n<ul>\r\n<li>How are they approaching the problem?</li>\r\n<li>What types of questions are they asking?</li> \r\n<li>What tools and methods are they bringing to bear on the problem?</li> \r\n<li>What knowledge and skills do they anticipate will be needed to effectively address this problem in the future?</li>\r\n</ul>\r\n<p>Another approach is to <a href=\"https://myplan.uw.edu\" target=\"_blank\">search for courses</a> with key words related to the issue you care about. Talk to a librarian to learn more about the perspectives different disciplines bring to bear on this issue. Know of a major that might be of interest? Find someone in that major and talk to them about it to learn what approaches to problems are used in that discipline.</p>\r\n\r\n<p>Finally, recognize that you may get to create your own career path through a combination of courses and majors; it's rare to find a major that exactly matches a career. Remember the world is constantly changing, and the job you end up doing may not exist yet!</p>", "image": "interview_db_images/solve_world_problems.jpg", "image_credit": "", "image_alt_text": "Students and faculties on a boat in Puget Sound studying various fish.", "category": 4, "slug": "solve-world-problems", "phase": "A", "quarter": "spring", "week": 10, "related_articles": [6, 13, 16, 20], "related_links": []}}, {"model": "interview_db.article", "pk": 11, "fields": {"title": "Pitch Your Story", "short_body": "A simple introduction can lead to job connections and other opportunities. Be prepared with a personal \"elevator pitch.\"", "long_body": "<p>Introducing yourself in social or professional settings can often set up connections for the future. Whether you are attending a formal job fair or mingling at an event, you want to capture a person’s attention and make an impression in a few minutes.</p>\r\n\r\n<p>An effective way to connect and to convey your message is a personal elevator pitch. This is a clear, concise, and specific statement that describes you, your interests, and your strengths in less than 30 seconds.</p>\r\n\r\n<p>Here are ways to prepare for pitching your story:</p>\r\n<ul>\r\n\r\n<li>Try creating a few sentences about who you are, what you're seeking, and what you can offer. Consider including what you care about, and what you like doing.</li> \r\n\r\n<li>Prepare and practice your pitch so it flows naturally. Practice alone and with friends so that you feel comfortable introducing yourself to new people.</li> \r\n\r\n<li>Tweak your pitch often to keep it current and to adapt it to each situation you are in.</li>\r\n\r\n<li>Be prepared for the next step; describing your experience, skills and the contributions you hope to make.</li>\r\n</ul>\r\n<p>Ideally your “elevator pitch” will leave someone wanting to know more about you and lead to a longer conversation or additional connections.</p>", "image": "interview_db_images/pitch_your_story.jpg", "image_credit": "UW College of Arts & Sciences", "image_alt_text": "Students mingle with guests during a Master of Fine Arts event.", "category": 2, "slug": "pitch-your-story", "phase": "A", "quarter": "spring", "week": 9, "related_articles": [3, 4, 18, 19], "related_links": [1, 8]}}, {"model": "interview_db.article", "pk": 12, "fields": {"title": "First Impressions Matter", "short_body": "How you present yourself in an email message can make (or break) your connection with another person. Being thoughtful and respectful can go a long way.", "long_body": "<p>Email messages to faculty, mentors, and potential employers should be brief and professional.</p>\r\n<p>Here are some tips that will help you make a good impression:</p>\r\n<ul>\r\n<li><strong>Include a useful subject line</strong> – a title like “meeting” will not be helpful for people who receive dozens of emails per day.</li>\r\n<li><strong>Use a greeting at the beginning</strong> – You can’t go wrong with “Hello” or “Dear (their name).” Default to a formal title (e.g. Mr., Mrs., Dr.) unless you are already on a first-name basis.</li>\r\n<li><strong>AVOID ALL CAPS!</strong> – Unless you really are intending to shout&#8230;.</li>\r\n<li><strong>Double-check attachments</strong> – Are they attached? Are they titled appropriately?</li> \r\n<li><strong>Develop an email signature</strong> – Use something that includes more information about you, such as a link to your online profile or portfolio.</li>\r\n</ul>\r\n<p>Taking time to present yourself and communicate carefully will help you make good first impressions, both online and in-person.</p>", "image": "interview_db_images/first_impressions_matter.jpg", "image_credit": "Dennis Wise", "image_alt_text": "A student composing an email on his laptop in Paccar Hall.", "category": 4, "slug": "first-impressions-matter", "phase": "A", "quarter": "spring", "week": 7, "related_articles": [3, 5, 11, 12], "related_links": [9]}}, {"model": "interview_db.article", "pk": 13, "fields": {"title": "Do Majors = Jobs?", "short_body": "Not always. Your major won't guarantee you a job, but thankfully it also won't likely restrict what you can achieve in your career.", "long_body": "<p>While some technical fields may be exceptions to this, <a href=\"http://www.naceweb.org/career-development/trends-and-predictions/job-outlook-2016-attributes-employers-want-to-see-on-new-college-graduates-resumes/\" target=\"_blank\" >most employers value attributes</a> like leadership, written and verbal communication, and the ability to solve complex problems over an individual's undergraduate major. This can help relieve the pressure of feeling locked into something for the rest of your life and allow you to approach your major as a way of building these sought after skills which lead to work experience.</p>\r\n\r\n<p>But you still have to figure out what you might want to do, right? There are lots of ways to <a href=\"https://www.washington.edu/uaa/advising/academic-planning/majors-and-minors/majors-and-careers/\" target=\"_blank\">explore career options</a> including asking yourself questions for reflection (what kind of work could you be immersed in?) and doing some research (what are your options?). Friends and family know you best and might also have ideas for what would be a good fit for you. Plus there are experts here at UW &#8211; academic advisers and career counselors &#8211; who can help you identify effective strategies for figuring out what you want to do.</p> \r\n\r\n<p>Ultimately, most people have a lot of flexibility for taking their major, combined with their other experiences, and shaping their career trajectory.</p>", "image": "interview_db_images/do_majors_equal_jobs.jpg", "image_credit": "Dennis Wise", "image_alt_text": "Two engineering students studying together at a whiteboard.", "category": 3, "slug": "do-majors-jobs", "phase": "A", "quarter": "spring", "week": 6, "related_articles": [6, 8, 16, 17], "related_links": [10, 11]}}, {"model": "interview_db.article", "pk": 14, "fields": {"title": "Bouncing Back", "short_body": "Everyone experiences failure. What can you learn when something goes wrong?", "long_body": "<p>You may have heard about a “fixed” vs. “growth” mindset. A mindset, or pattern of beliefs, can affect thoughts and behaviors positively or negatively.</p>\r\n\r\n<h3>A Fixed Mindset</h3>\r\n<p>In a “fixed mindset,” people believe that things like intelligence, character, and creative abilities are fixed traits. They may have been praised for their abilities when they were younger and may feel like they don’t need to put in a lot of effort because their achievements have always “just come naturally.” When people with a fixed mindset encounter a genuine challenge, they begin to doubt their abilities and avoid taking risks in the future, for fear of looking like a failure or having their deficiencies exposed. They’re also not very good at hearing critical feedback, because what they hear is that someone is disappointed in them, not that there are ways that they can improve their work, or their relationships.</p>\r\n\r\n<h3>A Growth Mindset</h3>\r\n<p>In contrast, people with a “growth mindset” believe that qualities like intelligence, creativity, and even the capacity for positive relationships, can be developed through effort and practice. They are not defined by their failures, but see them as an opportunity to try harder next time. When they encounter a challenge, they’re motivated to find a solution and may encourage themselves with the thought, “I don’t have the answer&#8230;yet.” In addition, people with a growth mindset welcome critical feedback, because they know it will tell them where they need to place their effort in order to succeed, in their work or relationships.</p>\r\n\r\n<p>You may have a “fixed” or “growth” mindset at different times in your life, or in different areas of your life. It’s worth learning more about these mindsets, as well as strategies for altering “fixed” beliefs. A “growth mindset” will help you improve your attitude toward failure, your comfort taking risks, and your chances for success. Practice it now, and it will serve you well into the future.</p>", "image": "interview_db_images/bouncing_back.jpg", "image_credit": "Katherine B. Turner", "image_alt_text": "Roses in bloom at the rose garden surrounding Drumheller Fountain.", "category": 3, "slug": "bouncing-back", "phase": "A", "quarter": "spring", "week": 4, "related_articles": [6, 9, 17], "related_links": [12, 13]}}, {"model": "interview_db.article", "pk": 15, "fields": {"title": "Everything Matters – Think About It", "short_body": "Whether you have been at UW for one year or five years, you have done a lot and learned a lot. Find out how you can make sense of everything you have done.", "long_body": "<p>At UW, you have taken classes, met new people, worked or interned or volunteered, made choices about your entertainment or travel. Many educators believe that you haven't really learned from an experience until you've reflected on it. It's reflection that helps you harvest insights from your experiences and make connections among them. There are places at the UW where deep reflection is built into your learning, like the Jackson School Task Force and the <a href=\"http://huskyleadership.uw.edu/programs/leadership-certificate/\" target=\"_blank\">Husky Leadership Certificate</a>, but you can practice reflection anytime.</p>\r\n\r\n<p>You can reflect on previous experiences by asking yourself questions like these:</p>\r\n<ul>\r\n<li>What have I done that has been surprising? Scary? Delightful?</li>\r\n<li>When was I the most creative and why?</li>\r\n<li>What experience sparked my curiosity?</li>\r\n<li>What experience has been the most challenging? The most rewarding?</li>\r\n</ul>\r\n<p>You can also incorporate reflection into your everyday life, whether in class or as part of a community:</p>\r\n<ul> \r\n<li>What are three things I learned today?</li> \r\n<li>What are two ways I will act on what I learned?</li> \r\n<li>What is one thing I want to know more about?</li> \r\n</ul>\r\n<p>Don't let the thought of reflection seem daunting (or time consuming); get in the habit of asking questions and making connections between what you see, hear, read, and experience. This will deepen your learning and guide your next steps.</p>", "image": "interview_db_images/everything_matters.jpg", "image_credit": "Doug Plummer", "image_alt_text": "A shared room in McMahon Hall, just one of 15 undergraduate housing options.", "category": 5, "slug": "everything-matters-think-about-it", "phase": "A", "quarter": "spring", "week": 3, "related_articles": [3, 16, 18, 19], "related_links": []}}, {"model": "interview_db.article", "pk": 16, "fields": {"title": "Got Experience?", "short_body": "Most professional trajectories are built on a combination of academic work and experience outside the classroom. What will you do?", "long_body": "<p>No matter where you are in your undergraduate career, you can always branch out and get experiences that will augment your classroom learning.</p>\r\n\r\n<p>Internships – an opportunity to learn while working – are one way. The Career and Internship Center has resources for all stages, from helping students search and find internships to assistance in making sense of their experience. The Career and Internship Center talked to students who shared <a href=\"https://youtu.be/oCz3pR5j8p0\">their internship advice</a>.</p>\r\n\r\n<p>Experience can also be found through other outside-the-classroom learning experiences like <a href=\"http://www.washington.edu/undergradresearch/\">undergraduate research</a> and <a href=\"http://www.washington.edu/carlson/students-3/browse-service-learning-positions/\">service-learning</a> or <a href=\"http://www.washington.edu/carlson/service-opportunities/\">volunteering</a>. This is not just about working in a lab or volunteering at a food bank – there are literally hundreds of different ways to contribute. You might be surprised by what you find. </p>\r\n\r\n<p>Doing something new and making connections with others can be scary. Remember that stepping out of your comfort zone can feel awkward and uncertain, but can result in rich rewards.</p>", "image": "interview_db_images/got_experience.jpg", "image_credit": "", "image_alt_text": "A team of students works with the Burke Museum to excavate a whale at Grayland Beach State Park.", "category": 4, "slug": "got-experience", "phase": "A", "quarter": "winter", "week": 7, "related_articles": [10, 11, 18, 19], "related_links": []}}, {"model": "interview_db.article", "pk": 17, "fields": {"title": "Are you your GPA?", "short_body": "You have spent your whole life believing that GPA matters. Does it?", "long_body": "<p>Sometimes a high GPA matters a lot, especially if you are aspiring to graduate or professional school. If that's the case, there are many resources on campus to help you improve your skills in reading, writing, problem solving, and time management – <a href=\"http://webster.uaa.washington.edu/asp/website/get-help/helpful-tips/overview/\">Academic Support Programs</a> is a good place to start.</p>\r\n\r\n<p>That said, most <a href=\"http://www.naceweb.org/career-development/trends-and-predictions/job-outlook-2016-attributes-employers-want-to-see-on-new-college-graduates-resumes/\">employers care more about your skills</a> and less about your GPA. In what ways are you cultivating your skills in leadership, communication, and teamwork? Here's where you want to think strategically about how you combine academic work and experience outside the classroom. </p>\r\n\r\n<p>Getting experience – and even getting good grades – doesn't mean anything unless you can show that you learned. Being able to talk about what you have learned, both inside and outside the classroom, is a key skill. In the end, the whole package – your ability to apply your academic knowledge to real-world problems, your engagement in experience outside the classroom, and a strong professional network – matters more in getting a job than magna cum laude.</p>", "image": "interview_db_images/are_you_your_gpa.jpg", "image_credit": "", "image_alt_text": "Students in the College of Education take a quiz during class.", "category": 4, "slug": "are-you-your-gpa", "phase": "A", "quarter": "winter", "week": 8, "related_articles": [4, 5, 6, 16], "related_links": []}}, {"model": "interview_db.article", "pk": 18, "fields": {"title": "Does Your Résumé Represent You?", "short_body": "Résumés tell the story of your skills and experience. Think you don't have any? Follow this 3-step process to mine your experiences and name your skills.", "long_body": "<p>The <a href=\"https://careers.uw.edu/resources/resumes-tips-advice/view/\" target=\"_brand\">Career Center</a> says the way to write about your experience is to start with a verb, describe what you did, and end with a result. If you can, grab a buddy for this activity, so you can ask each other questions and unearth the knowledge and skills you used in a variety of tasks.</p> \r\n\r\n<h3>1. Brainstorm</h3>\r\n<p>Get information on paper and don’t worry about perfection.</p>   \r\n<p>Pick an experience (summer job, babysitting, volunteering, research, etc.). Write down the name of your employer or supervisor, your job title, dates of employment (the month and year you started and ended), and location.</p>\r\n<p>Write one sentence that summarizes what you did – a short description of the whole experience. Just write, don’t edit.</p>\r\n<p>Flesh out the description by considering questions like these, or have your buddy ask you these questions:</p>\r\n<ul>\r\n<li>What did you do on a typical day?</li>\r\n<li>Were you involved in a project? From start to finish, or for what portion?</li> \r\n<li>Did you work alone or collaboratively? What was your role?</li> \r\n<li>Did you take on increasing duties and/or responsibilities over time?</li> \r\n<li>Did people receive better/faster service because of you?<li> \r\n<li>Did someone learn something from your instruction or participation?<li>\r\n</ul>\r\n<p>Again, just write.</p>\r\n\r\n<p>Repeat the steps above for each experience (employment, volunteering) you plan to include.</p> \r\n\r\n<h3>2. Translate</h3>\r\n<p>Rewrite your brainstorm notes to help employers understand specifically what you did.</p>\r\n<p>Look at your first experience. Imagine an employer saying, \"Tell me more.\" Experiment with ways to describe your experience more clearly and to be more specific and/or detailed. For example, if you initially wrote, “Constructed decks and patio covers” to describe your work, you might think about what other information an employer would want to know. Your new description might be, \"Involved in planning through completion with construction of custom decks and patio covers for residential clients.”</p> \r\n\r\n<p>Again, repeat this step for each experience you plan to include. When you're done, have your buddy or someone else read over all your descriptions and identify the places where they want to know more details. Revise as necessary.</p> \r\n\r\n<h3>3. Format &#38; Polish</h3> \r\n<p>Format and edit your resume. Make it shine.</p>  \r\n<p>Look at the Career Center <a href=\"https://careers.uw.edu/resources/resumes-tips-advice/view/\" target=\"_blank\"> guidelines </a> for formatting a resume. Arrange your experiences in this format.</p>\r\n<ul>\r\n<li>Spell check.</li>\r\n<li>Make sure your contact information is correct and your e-mail address is professional.</li>\r\n<li>Adjust the font and headers so that there is a clear hierarchy of information. Make sure your resume is easy to skim &#8211; the average review time is 10 seconds.</li>\r\n<li>Hand your resume to someone who is good at spelling, grammar and editing. Ask them to identify any errors and then correct these.</li> \r\n<li>Spell check again.</li>\r\n</ul>\r\n<p>Think about where you are submitting your resume.Place the most relevant experience on top; it is critical for the reader to see a match between your experience and their job description in that 10 second skim.</p> \r\n\r\n<h3>Congratulate yourself</h3>\r\n<p>Constructing a résumé is not easy, but you did it.</p>", "image": "interview_db_images/does_resume_represent_you.jpg", "image_credit": "Doug Plummer", "image_alt_text": "Student working at a residence hall.", "category": 2, "slug": "does-your-resume-represent-you", "phase": "A", "quarter": "spring", "week": 1, "related_articles": [5, 11, 16, 19], "related_links": []}}, {"model": "interview_db.article", "pk": 19, "fields": {"title": "Plan Your Life by Accident", "short_body": "\"Accidents\" – unplanned events or serendipitous encounters – are often what people say led them to their major or career. You, too, can make the most of an \"accident.\"", "long_body": "<p>Sometimes you intend to have an experience, like an internship in your field of interest. Othertimes, there's \"just what happened\" – like when your internship doesn't pan out and a friend ropes you into volunteering for Alternative Spring Break, or someone nominates you to be on a panel talking about your undergrad research project. </p>\r\n\r\n<p>How do you make the most of these \"accidental\" experiences? Mine them for information about what does – and does not – engage you. Did the experience bring you joy? Did it sap your energy or fire you up? To get more detailed insights, try the “AEIOU” method.</p>\r\n\r\n<p>Here’s how Bill Burnett and Dave Evans describe the method in their book, “Designing Your Life”:</p>\r\n\r\n<ul>\r\n<li><strong>Activities</strong> – What were you actually doing? Was this a structured or unstructured activity? Did you have a specific role to play (team leader) or were you just a participant (at a meeting)?</li>\r\n<li><strong>Environments</strong> – Our environment has a profound effect on our emotional state. You feel one way at a football stadium, another in a cathedral. Notice where you were when you were involved in the activity. What kind of place was it, and how did it make you feel?</li>\r\n<li><strong>Interactions</strong> – What were you interacting with–people or machines? Was it a new kind of interaction or one you are familiar with? Was it formal or informal?</li>\r\n<li><strong>Objects</strong> – Were you interacting with any objects or devices–iPads or smartphones, hockey sticks or sailboats? What were the objects that created or supported your feeling engaged?</li>\r\n<li><strong>Users</strong> – Who else was there and what role did they play in making it either a positive or negative experience?</li>\r\n</ul>\r\n\r\n<p>When you’re able to identify specifically what makes an experience delightful or dull, you can intentionally choose a next experience, and you’re on your way to designing a fulfilling and happy life.</p>", "image": "interview_db_images/plan_life_by_accident.jpg", "image_credit": "", "image_alt_text": "An Environmental Science student explores the rings of a tree on a field trip in the North Cascades.", "category": 5, "slug": "plan-your-life-accident", "phase": "A", "quarter": "winter", "week": 9, "related_articles": [8, 10, 13, 16], "related_links": [16, 17]}}, {"model": "interview_db.article", "pk": 20, "fields": {"title": "What If the Grade Didn't Matter?", "short_body": "At UW, you get to choose how you spend your valuable intellectual energy. What questions compel you? What class would you take if the grade didn’t matter?", "long_body": "<p>UW is a city of learning with professors whose expertise spans a vast range of topics. Take advantage of this by choosing courses that grab your interest.</p> \r\n\r\n<p>Here are some ways to match your interests to class selection:</p>\r\n<ul>\r\n<li>What news or current events are you drawn to? What big questions keep you up at night? Identify the disciplines (tip: advisers can help!) that will help you explore these ideas.</li>\r\n\r\n<li>Think of a faculty member who inspires you, and look at the range of courses he or she teaches. Is there a topic you would not want to miss learning about?</li> \r\n\r\n<li><a href=\"http://www.washington.edu/students/timeschd/  target=\"_blank\">Browse the time schedule</a> or <a href=\" https://myplan.uw.edu/\" target=\"_blank\">search MyPlan</a> for classes that look intriguing.</li> \r\n\r\n<p>It is worth your time to take classes that compel you as they can open up new ideas and opportunities.</p>\r\n\r\n</ul>", "image": "interview_db_images/what_if_the_grade_didnt_matter.jpg", "image_credit": "", "image_alt_text": "A UW student listens attentively in a large lecture.", "category": 3, "slug": "what-if-grade-didnt-matter", "phase": "A", "quarter": "spring", "week": 5, "related_articles": [6, 8, 10, 17], "related_links": [18, 19]}}, {"model": "interview_db.article", "pk": 21, "fields": {"title": "Tools to Help You Along the Way", "short_body": "Whether you’re just starting out or graduating soon, this collection of expert advice will help you maximize your learning and well-being.", "long_body": "<p>Creating your Husky Experience is an opportunity unique to you, but you don’t have to start from scratch or go it alone. We are a team of UW staff members who spent time collecting suggestions – from students, faculty, and other staff – on how to help all students successfully create the kind of Husky Experience that will serve them well.</p>\r\n\r\n<p>The Husky Experience Toolkit is a collection of suggestions to help you challenge yourself, think about options, and weave together all you are learning. They are being delivered via MyUW so that all students have access to these ideas and resources.<p>\r\n\r\n<p>Watch this space for a new message each week, or visit the <a href=\"/husky_experience\">Husky Experience page</a> any time.</p>", "image": "interview_db_images/tools_to_help_along_the_way.jpg", "image_credit": "Katherine B. Turner", "image_alt_text": "Two students walk through the quad on the second day of Fall quarter.", "category": 5, "slug": "tools-help-you-along-way", "phase": "A", "quarter": "winter", "week": 1, "related_articles": [], "related_links": []}}, {"model": "interview_db.article", "pk": 22, "fields": {"title": "Fight Decision Fatigue", "short_body": "Some decisions, even small ones, can be really difficult to make. Decision-making strategies, however can help with both big and small decisions.", "long_body": "<p>Sometimes decisions are not life-defining, but seem soul sucking. Study environmental science or work on my essay for history? Go to the accounting club meeting or the leadership lecture? Decisions can be hard and take time but having  some techniques to use makes it easier.</p>\r\n\r\n<p>Try some of these strategies next time:</p> \r\n<ul>\r\n<li>Define your choices and seek information</li>\r\n<li>Make a pro/con list or a cost-benefit analysis</li>\r\n<li>Imagine the advice you would give to a friend</li>\r\n<li>Experiment with having the choice made for you and seeing how you feel about it</li>\r\n<li>Need to make a quick decision? Set a timer!</li>\r\n</ul>", "image": "interview_db_images/fight_decision_fatigue.jpg", "image_credit": "", "image_alt_text": "A tired student focused on his laptop in a study booth.", "category": 3, "slug": "fight-decision-fatigue", "phase": "A", "quarter": "winter", "week": 10, "related_articles": [10, 16, 20], "related_links": [20, 21]}}]